 [
    {
      "pictureUrl": "https://ibb.co/2jfCyDv",
      "name": "Alphabet Puzzle",
      "sellerName": "Learning Toys Co.",
      "sellerEmail": "info@learningtoysco.com",
      "subCategory": "Language Toys",
      "price": "$19.99",
      "rating": 4.5,
      "availableQuantity": 10,
      "detailDescription": "The Alphabet Puzzle is a fun and interactive toy that helps children learn letters and develop fine motor skills. Each puzzle piece features a letter of the alphabet along with a corresponding image. Kids can practice letter recognition and hand-eye coordination while assembling the puzzle. Suitable for children aged 3 and above."
    },
    {
      "pictureUrl": "https://ibb.co/vQTJDM0",
      "name": "Math Dice Set",
      "sellerName": "Brainy Games",
      "sellerEmail": "sales@brainygames.com",
      "subCategory": "Math Toys",
      "price": "$12.99",
      "rating": 4.2,
      "availableQuantity": 15,
      "detailDescription": "The Math Dice Set is a fantastic tool for enhancing math skills in a playful way. The set includes dice with numbers and operations symbols. Children can roll the dice and create equations, fostering number sense and mental math abilities. This versatile toy is suitable for various math activities and games. Suitable for children aged 6 and above."
    },
    {
      "pictureUrl": "https://ibb.co/vLL0JgK",
      "name": "Magnetic Science Kit",
      "sellerName": "Science Wonders",
      "sellerEmail": "sales@sciencewonders.com",
      "subCategory": "Science Toys",
      "price": "$29.99",
      "rating": 4.8,
      "availableQuantity": 8,
      "detailDescription": "The Magnetic Science Kit introduces children to the fascinating world of magnets and magnetic forces. With a variety of magnets, metal pieces, and experiment cards, kids can explore concepts like attraction, repulsion, and magnetic fields. This kit provides hands-on learning and promotes scientific inquiry. Suitable for children aged 8 and above."
    },
    {
      "pictureUrl": "https://ibb.co/t8RQcVg",
      "name": "Telling Time Clock",
      "sellerName": "Tick Tock Toys",
      "sellerEmail": "info@ticktocktoys.com",
      "subCategory": "Math Toys",
      "price": "$16.99",
      "rating": 4.6,
      "availableQuantity": 12,
      "detailDescription": "The Telling Time Clock is a valuable tool for teaching children how to read analog clocks. It features movable hands and clear markings for hours, minutes, and seconds. Kids can practice telling time and understanding concepts like AM and PM. This toy helps develop time-telling skills and supports math learning. Suitable for children aged 5 and above."
    },
    {
      "pictureUrl": "https://ibb.co/t8RQcVg",
      "name": "Solar System Model",
      "sellerName": "Stellar Toys",
      "sellerEmail": "sales@stellartoys.com",
      "subCategory": "Science Toys",
      "price": "$39.99",
      "rating": 4.9,
      "availableQuantity": 5,
      "detailDescription": "The Solar System Model provides a hands-on learning experience about our celestial neighborhood. It includes a set of planet models with accurate sizes and details, along with a base displaying the sun. Kids can explore the relative positions and characteristics of the planets while gaining knowledge about space. Suitable for children aged 8 and above."
    },
    {
      "pictureUrl": "https://ibb.co/t8RQcVg",
      "name": "Spelling Bee Game",
      "sellerName": "Word Wizards",
      "sellerEmail": "info@wordwizards.com",
      "subCategory": "Language Toys",
      "price": "$24.99",
      "rating": 4.4,
      "availableQuantity": 7,
      "detailDescription": "The Spelling Bee Game is an exciting way to improve spelling and vocabulary skills. It includes a set of word cards with various difficulty levels and a game board. Children take turns spelling words and earn points for correct answers. This game promotes word recognition and literacy development. Suitable for children aged 6 and above."
    },
    {
      "pictureUrl": "https://ibb.co/t8RQcVg",
      "name": "Pattern Blocks Set",
      "sellerName": "Creative Minds",
      "sellerEmail": "sales@creativeminds.com",
      "subCategory": "Math Toys",
      "price": "$14.99",
      "rating": 4.7,
      "availableQuantity": 20,
      "detailDescription": "The Pattern Blocks Set is a versatile math manipulative that helps children explore geometric shapes, symmetry, and spatial relationships. It includes various colorful shapes that can be arranged to create patterns and designs. This set encourages critical thinking and problem-solving skills. Suitable for children aged 4 and above."
    },
    {
      "pictureUrl": "https://ibb.co/t4T69Y9",
      "name": "Human Anatomy Puzzle",
      "sellerName": "Bio Explorers",
      "sellerEmail": "info@bioexplorers.com",
      "subCategory": "Science Toys",
      "price": "$32.99",
      "rating": 4.8,
      "availableQuantity": 10,
      "detailDescription": "The Human Anatomy Puzzle provides an interactive way to learn about the human body. It features a detailed puzzle with various organ pieces and a guidebook explaining their functions. Kids can assemble the puzzle while gaining knowledge about the different body systems. This toy promotes biology understanding and scientific curiosity. Suitable for children aged 7 and above."
    },
    {
      "pictureUrl": "https://ibb.co/zr7skFR",
      "name": "Magnetic Poetry Kit",
      "sellerName": "WordSmiths",
      "sellerEmail": "info@wordsmiths.com",
      "subCategory": "Language Toys",
      "price": "$19.99",
      "rating": 4.3,
      "availableQuantity": 15,
      "detailDescription": "The Magnetic Poetry Kit is a creative toy that encourages language exploration and poetic expression. It includes a set of magnetic word tiles that can be arranged on a magnetic surface to create poems and stories. This kit inspires imagination and enhances language skills. Suitable for children aged 10 and above."
    },
    {
      "pictureUrl": "https://ibb.co/bK0MxrC",
      "name": "Geography World Map Puzzle",
      "sellerName": "Geo Explorers",
      "sellerEmail": "info@geoexplorers.com",
      "subCategory": "Social Studies Toys",
      "price": "$22.99",
      "rating": 4.6,
      "availableQuantity": 8,
      "detailDescription": "The Geography World Map Puzzle is an educational toy that helps children learn about continents, countries, and landmarks around the world. It features a puzzle map with labeled pieces and a poster for reference. Kids can develop geography knowledge and enhance their global awareness. Suitable for children aged 6 and above."
    }
  ]
  